/*
 Navicat Premium Data Transfer

 Source Server         : dyb
 Source Server Type    : MySQL
 Source Server Version : 50540
 Source Host           : localhost:3306
 Source Schema         : kfc

 Target Server Type    : MySQL
 Target Server Version : 50540
 File Encoding         : 65001

 Date: 12/07/2020 17:56:39
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for meal
-- ----------------------------
DROP TABLE IF EXISTS `meal`;
CREATE TABLE `meal`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `mno` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `mname` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `price` decimal(7, 2) NULL DEFAULT NULL,
  `remark` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `mimg` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `typeid` int(11) NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 24 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Compact;

-- ----------------------------
-- Records of meal
-- ----------------------------
INSERT INTO `meal` VALUES (1, 'm001', '1元香脆薯饼', 1.00, '产品实付满49元（不含外送费），可1元换购香脆薯饼1个，每单限1份', '1元香脆薯饼.jpg', 1);
INSERT INTO `meal` VALUES (2, 'm002', '1元冬菇滑鸡粥', 1.00, '产品实付满69元（不含外送费），可1元换购冬菇滑鸡粥1份，每单限1份', '1元冬菇滑鸡粥.jpg', 1);
INSERT INTO `meal` VALUES (3, 'm003', '有鸡腿中式粥双人餐', 58.00, '套餐包含：有鸡腿中式全餐2份\r\n有鸡腿中式全餐：新奥尔良烤鸡腿1份+现熬好粥1份（可加价换购）+培根炒蛋1份+安心大油条1根+早餐饮品1杯（可加价换购）', '有鸡腿中式粥双人餐.jpg', 2);
INSERT INTO `meal` VALUES (4, 'm004', '中西全餐双人餐香颂', 67.00, '套餐包含：有鸡腿中式皮蛋粥全餐+有鸡腿西式香草流心可颂全餐，共2份\r\n有鸡腿中式全餐：新奥尔良烤鸡腿1份+皮蛋瘦肉粥1份+培根炒蛋1份+安心大油条1根+早餐饮品1杯（可加价换购）\r\n套餐包含：有鸡腿中式皮蛋粥全餐+有鸡腿西式香草流心可颂全餐，共2份\r\n有鸡腿中式全餐：新奥尔良烤鸡腿1份+皮蛋瘦肉粥1份+培根炒蛋1份+安心大油条1根+早餐饮品1杯（可加价换购）\r\n有鸡腿西式全餐：新奥尔良烤鸡腿1份+大溪地香草奶香流心可颂2只+培根炒蛋1份+香脆薯饼1个+早餐饮品1杯（可加价换购）', '中西全餐双人餐香颂.jpg', 2);
INSERT INTO `meal` VALUES (5, 'm005', '帕尼粥大饼三人餐', 65.00, '芝士猪柳蛋帕尼尼1份+皮蛋瘦肉粥1份+大饼卷香烤鸡扒蛋1份+安心大油条1根+香脆薯饼1份+葡式蛋挞（经典）1只+早餐饮品3杯（可加价换购）', '帕尼粥大饼三人餐.jpg', 2);
INSERT INTO `meal` VALUES (6, 'm006', '帕尼粥饭团三人餐', 65.00, '芝士猪柳蛋帕尼尼1份+皮蛋瘦肉粥1份+金沙咸蛋黄肉酥饭团1份+安心大油条1根+香脆薯饼1份+葡式蛋挞（经典）1只+早餐饮品3杯（可加价换购）', '帕尼粥饭团三人餐.jpg', 2);
INSERT INTO `meal` VALUES (7, 'm007', '有鸡腿中式粥餐浆餐', 35.00, '新奥尔良烤鸡腿1份+现熬好粥1份（可选）+培根炒蛋1份+安心大油条1根+早餐豆浆饮品1杯（可加价换购）', '有鸡腿中式粥餐浆餐.jpg', 2);
INSERT INTO `meal` VALUES (8, 'm008', '大饼卷鸡扒茶叶蛋餐', 29.00, '大饼卷鸡扒蛋1份+九龙金玉茶叶蛋1只+早餐饮品1杯（可加价换购） 产品及包装以实物为准', '大饼卷鸡扒茶叶蛋餐.jpg', 2);
INSERT INTO `meal` VALUES (9, 'm009', '中西全餐双人餐香颂', 67.00, '套餐包含：有鸡腿中式皮蛋粥全餐+有鸡腿西式香草流心可颂全餐，共2份\r\n有鸡腿中式全餐：新奥尔良烤鸡腿1份+皮蛋瘦肉粥1份+培根炒蛋1份+安心大油条1根+早餐饮品1杯（可加价换购）\r\n有鸡腿西式全餐：新奥尔良烤鸡腿1份+大溪地香草奶香流心可颂2只+培根炒蛋1份+香脆薯饼1个+早餐饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准', '中西全餐双人餐香颂.jpg', 3);
INSERT INTO `meal` VALUES (10, 'm010', '中西全餐双人餐法颂', 62.00, '套餐包含：有鸡腿中式皮蛋粥全餐+有鸡腿西式现烤法式可颂全餐，共2份\r\n有鸡腿中式全餐：新奥尔良烤鸡腿1份+皮蛋瘦肉粥1份+培根炒蛋1份+安心大油条1根+早餐饮品1杯（可加价换购）\r\n有鸡腿西式全餐：新奥尔良烤鸡腿1份+现烤法式可颂2只+培根炒蛋1份+香脆薯饼1个+早餐饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准', '中西全餐双人餐法颂.jpg', 3);
INSERT INTO `meal` VALUES (11, 'm011', '有鸡腿中式粥双人餐', 58.00, '套餐包含：有鸡腿中式全餐2份\r\n有鸡腿中式全餐：新奥尔良烤鸡腿1份+现熬好粥1份（可加价换购）+培根炒蛋1份+安心大油条1根+早餐饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准', '有鸡腿中式粥双人餐.jpg', 3);
INSERT INTO `meal` VALUES (12, 'm012', '有鸡腿全餐法式颂咖', 37.00, '新奥尔良烤鸡腿1份+现烤法式可颂2只+培根炒蛋1份+香脆薯饼1个+早餐咖啡饮品1杯（可加价换购）\r\n产品及包装以实物为准', '有鸡腿全餐法式颂咖.jpg', 3);
INSERT INTO `meal` VALUES (13, 'm013', '有鸡腿全餐法颂蛋咖', 37.00, '奥尔良烤鸡腿+现烤法式可颂+太阳蛋+香脆薯饼+咖啡饮品\r\n产品及包装以实物为准', '有鸡腿全餐法颂蛋咖.jpg', 3);
INSERT INTO `meal` VALUES (14, 'm014', '有鸡腿中式粥餐浆餐', 35.00, '新奥尔良烤鸡腿1份+现熬好粥1份（可选）+培根炒蛋1份+安心大油条1根+早餐豆浆饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准。', '有鸡腿中式粥餐浆餐.jpg', 3);
INSERT INTO `meal` VALUES (15, 'm015', '有鸡腿中式粥蛋浆餐', 35.00, '新奥尔良烤鸡腿1份+现熬好粥1份（可选）+太阳蛋1份+安心大油条1根+早餐豆浆饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准。', '有鸡腿中式粥蛋浆餐.jpg', 3);
INSERT INTO `meal` VALUES (16, 'm016', '大饼卷鸡扒茶叶蛋餐', 29.00, '大饼卷鸡扒蛋1份+九龙金玉茶叶蛋1只+早餐饮品1杯（可加价换购） 产品及包装以实物为准', '大饼卷鸡扒茶叶蛋餐.jpg', 4);
INSERT INTO `meal` VALUES (17, 'm017', '大饼卷肉丝茶叶蛋餐', 27.00, '大饼卷卤肉丝1份+九龙金玉茶叶蛋1只+早餐饮品1杯（可加价换购） 产品及包装以实物为准', '大饼卷肉丝茶叶蛋餐.jpg', 4);
INSERT INTO `meal` VALUES (18, 'm018', '大饼鸡扒蛋配餐饮品', 28.50, '大饼卷鸡扒蛋1份+配餐1份+早餐饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准\r\n\r\n大饼卷鸡扒蛋1份+配餐1份+早餐饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准\r\n\r\n', '大饼鸡扒蛋配餐饮品.jpg', 4);
INSERT INTO `meal` VALUES (19, 'm019', '大饼卤肉丝配餐饮品', 26.50, '大饼卷卤肉丝1份+配餐1份+早餐饮品1杯（可加价换购）\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准', '大饼卤肉丝配餐饮品.jpg', 4);
INSERT INTO `meal` VALUES (20, 'm020', '大饼卷鸡扒蛋饮品', 23.00, '大饼卷香烤鸡扒蛋1个+饮品1杯(可加价换购)\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准。', '大饼卷鸡扒蛋饮品.jpg', 4);
INSERT INTO `meal` VALUES (21, 'm021', '大饼卷卤肉丝饮品', 21.00, '大饼卷京酱卤肉丝1个+饮品1杯(可加价换购)\r\n省是指比菜单单品总价省的金额\r\n产品及包装以实物为准。\r\n\r\n', '大饼卷卤肉丝饮品.jpg', 4);
INSERT INTO `meal` VALUES (22, 'm022', '大饼卷香烤鸡扒蛋', 17.50, '主要原料:烙饼、酸辣土豆丝、鸡扒、黄瓜段、培根炒蛋、面酱、薄脆\r\n产品及包装以实物为准。', '大饼卷香烤鸡扒蛋.jpg', 4);
INSERT INTO `meal` VALUES (23, 'm023', '大饼卷京酱卤肉丝', 15.50, '主要原料:烙饼、酸辣土豆丝、卤香鸡肉丝、黄瓜段、培根炒蛋、面酱、薄脆\r\n产品及包装以实物为准。', '大饼卷京酱卤肉丝.jpg', 4);

SET FOREIGN_KEY_CHECKS = 1;
